backend-api/app/controllers/donations_controller.rb

  def create
    @donation = Donation.create!(donation_params)
---
INSERT INTO "donations" ("donor_name", "donor_email", "donor_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["donor_name", "Patrick Harrison"], ["donor_email", "jahman@bellatlantic.net"], ["donor_amount", ""], ["created_at", "2020-12-06 02:44:03.780564"], ["updated_at", "2020-12-06 02:44:03.780564"]]

  def update
    @donation = Donation.find(params[:id])
    @donation.update(donation_params)
---
SELECT "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "donations" SET "donor_name" = ?, "donor_email" = ?, "donor_amount" = ?, "updated_at" = ? WHERE "donations"."id" = ?  [["donor_name", "Brooklyn jimlop"], ["donor_email", "patrick.harrison@brtriosopnm.net"], ["donor_amount", "7689"], ["updated_at", "2020-12-07 02:16:15.005180"], ["id", 27]]