Charity_api/backend-api/app/controllers/charities_controller.rb

SELECT "charities".* FROM "charities"
---
  def index
    @charities = Charity.all

SELECT "charities".* FROM "charities" WHERE "charities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @charity = Charity.find(params[:id])